src/Catalogs/Станции/Станции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Станции</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/СтатусыСтанций/СтатусыСтанций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСтанций</name>
  <enumValues>
    <name>Ок</name>
  </enumValues>
  <enumValues>
    <name>Проверка</name>
  </enumValues>
  <enumValues>
    <name>ПрофилактическиеРаботы</name>
  </enumValues>
  <enumValues>
    <name>РаботыПоУлучшению</name>
  </enumValues>
  <enumValues>
    <name>РемонтныеРаботы</name>
  </enumValues>
  <enumValues>
    <name>Демонтаж</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПриостановкаРаботыСтанции/ПриостановкаРаботыСтанции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриостановкаРаботыСтанции</name>
  <registerRecords>InformationRegister.СтатусСтанций</registerRecords>
  <registerRecords>InformationRegister.СостояниеНоменклатуры</registerRecords>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </attributes>
</mdclass:Document>

src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИнформационнойБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>320</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Станции/Forms/ФормаЭлемента/Module.bsl
//@strict-types

&НаКлиенте
Процедура УведомитьОПоломке(Команда)
	ПоказатьПредупреждение( , "Уведомление создано.");
	УведомитьОПоломкеНаСервере();
КонецПроцедуры

&НаСервере
Процедура УведомитьОПоломкеНаСервере()
	Документ = Документы.ПриостановкаРаботыСтанции.СоздатьДокумент();
	Документ.Дата = ТекущаяДатаСеанса();
	Документ.Станция = Объект.Ссылка;
	Документ.ПричинаОстановки = Перечисления.СтатусыСтанций.Проверка;
	Документ.Записать();
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.ЭлектроннаяПочта,
	|	Сотрудники.Наименование
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Должность = ЗНАЧЕНИЕ(Справочник.Должности.МастерСтанции)";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Наименование = ВыборкаДетальныеЗаписи["Наименование"]; // Строка -
		ЭлектроннаяПочта = ВыборкаДетальныеЗаписи["ЭлектроннаяПочта"]; // Строка -
		ПосылкаПочтыВызовСервера.ПростаяОтправкаПисьма(ЭлектроннаяПочта, "Уведомление о поломке", "Добрый день, "
			+ Наименование + "!
							 |
							 |Сегодня, +" + Формат(ТекущаяДатаСеанса(), "ДФ='d MMMM yyyy ''года'''") + ",
																									   |поступило уведомление о поломке станции "
			+ Объект.Наименование + ", номер " + Объект.Код + ".", , );
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	ПосылкаПочтыВызовСервера.ПростаяОтправкаПисьма( , , , , );
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДоступнаяНоменклатура.Параметры.УстановитьЗначениеПараметра("Станция", Объект.Ссылка);
КонецПроцедуры
